{
	"format": "layers-model",
	"generatedBy": "keras v3.8.0",
	"convertedBy": "TensorFlow.js Converter v4.22.0",
	"modelTopology": {
		"keras_version": "3.8.0",
		"backend": "tensorflow",
		"model_config": {
			"class_name": "Functional",
			"config": {
				"name": "functional",
				"trainable": true,
				"layers": [
					{
						"class_name": "InputLayer",
						"config": {
							"batch_shape": [null, 50, 33, 8],
							"dtype": "float32",
							"sparse": false,
							"name": "input_layer"
						},
						"name": "input_layer",
						"inbound_nodes": []
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 8],
											"dtype": "float32",
											"keras_history": [
												"input_layer",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "GraphConv",
						"config": {
							"out_channels": 64,
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "graph_conv",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 8],
											"dtype": "float32",
											"keras_history": [
												"batch_normalization",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_1",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_1",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"graph_conv",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"batch_normalization_1",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "DepthwiseConv2D",
						"config": {
							"name": "depthwise_conv2d",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"depth_multiplier": 1,
							"kernel_size": [9, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"activation": "linear",
							"use_bias": true,
							"depthwise_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"depthwise_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"depthwise_constraint": null,
							"bias_constraint": null
						},
						"name": "depthwise_conv2d",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_1",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"filters": 64,
							"kernel_size": [1, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"groups": 1,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_1",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"depthwise_conv2d",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_2",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"filters": 64,
							"kernel_size": [1, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"groups": 1,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_2",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 8],
											"dtype": "float32",
											"keras_history": [
												"batch_normalization",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_2",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_2",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["conv2d_1", 0, 0]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_3",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_3",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["conv2d_2", 0, 0]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "add",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "add",
						"inbound_nodes": [
							{
								"args": [
									[
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"batch_normalization_2",
													0,
													0
												]
											}
										},
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"batch_normalization_3",
													0,
													0
												]
											}
										}
									]
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_1",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_1",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["add", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"rate": 0.5,
							"seed": null,
							"noise_shape": null
						},
						"name": "dropout",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation_1",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "training": false }
							}
						]
					},
					{
						"class_name": "GraphConv",
						"config": {
							"out_channels": 64,
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "graph_conv_1",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["dropout", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_4",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_4",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"graph_conv_1",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_2",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_2",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"batch_normalization_4",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "DepthwiseConv2D",
						"config": {
							"name": "depthwise_conv2d_1",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"depth_multiplier": 1,
							"kernel_size": [9, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"activation": "linear",
							"use_bias": true,
							"depthwise_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"depthwise_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"depthwise_constraint": null,
							"bias_constraint": null
						},
						"name": "depthwise_conv2d_1",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation_2",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_4",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"filters": 64,
							"kernel_size": [1, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"groups": 1,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_4",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"depthwise_conv2d_1",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_5",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_5",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["conv2d_4", 0, 0]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "add_1",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "add_1",
						"inbound_nodes": [
							{
								"args": [
									[
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"batch_normalization_5",
													0,
													0
												]
											}
										},
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"dropout",
													0,
													0
												]
											}
										}
									]
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_3",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_3",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["add_1", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout_1",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"rate": 0.5,
							"seed": null,
							"noise_shape": null
						},
						"name": "dropout_1",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation_3",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "training": false }
							}
						]
					},
					{
						"class_name": "GraphConv",
						"config": {
							"out_channels": 64,
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "graph_conv_2",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["dropout_1", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_6",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_6",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"graph_conv_2",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_4",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_4",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"batch_normalization_6",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "DepthwiseConv2D",
						"config": {
							"name": "depthwise_conv2d_2",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"depth_multiplier": 1,
							"kernel_size": [9, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"activation": "linear",
							"use_bias": true,
							"depthwise_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"depthwise_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"depthwise_constraint": null,
							"bias_constraint": null
						},
						"name": "depthwise_conv2d_2",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation_4",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_6",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"filters": 64,
							"kernel_size": [1, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"groups": 1,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_6",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"depthwise_conv2d_2",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_7",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_7",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["conv2d_6", 0, 0]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "add_2",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "add_2",
						"inbound_nodes": [
							{
								"args": [
									[
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"batch_normalization_7",
													0,
													0
												]
											}
										},
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"dropout_1",
													0,
													0
												]
											}
										}
									]
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_5",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_5",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["add_2", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout_2",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"rate": 0.5,
							"seed": null,
							"noise_shape": null
						},
						"name": "dropout_2",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation_5",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "training": false }
							}
						]
					},
					{
						"class_name": "GraphConv",
						"config": {
							"out_channels": 64,
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "graph_conv_3",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["dropout_2", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_8",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_8",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"graph_conv_3",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_6",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_6",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"batch_normalization_8",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "DepthwiseConv2D",
						"config": {
							"name": "depthwise_conv2d_3",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"depth_multiplier": 1,
							"kernel_size": [9, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"activation": "linear",
							"use_bias": true,
							"depthwise_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"depthwise_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"depthwise_constraint": null,
							"bias_constraint": null
						},
						"name": "depthwise_conv2d_3",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation_6",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Conv2D",
						"config": {
							"name": "conv2d_8",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"filters": 64,
							"kernel_size": [1, 1],
							"strides": [1, 1],
							"padding": "same",
							"data_format": "channels_last",
							"dilation_rate": [1, 1],
							"groups": 1,
							"activation": "linear",
							"use_bias": true,
							"kernel_initializer": {
								"module": "keras.initializers",
								"class_name": "GlorotUniform",
								"config": { "seed": null },
								"registered_name": null
							},
							"bias_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"kernel_regularizer": {
								"module": "keras.regularizers",
								"class_name": "L2",
								"config": { "l2": 0.0001 },
								"registered_name": null
							},
							"bias_regularizer": null,
							"activity_regularizer": null,
							"kernel_constraint": null,
							"bias_constraint": null
						},
						"name": "conv2d_8",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"depthwise_conv2d_3",
												0,
												0
											]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_9",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_9",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["conv2d_8", 0, 0]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Add",
						"config": {
							"name": "add_3",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "add_3",
						"inbound_nodes": [
							{
								"args": [
									[
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"batch_normalization_9",
													0,
													0
												]
											}
										},
										{
											"class_name": "__keras_tensor__",
											"config": {
												"shape": [null, 50, 33, 64],
												"dtype": "float32",
												"keras_history": [
													"dropout_2",
													0,
													0
												]
											}
										}
									]
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_7",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_7",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["add_3", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "Dropout",
						"config": {
							"name": "dropout_3",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"rate": 0.5,
							"seed": null,
							"noise_shape": null
						},
						"name": "dropout_3",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": [
												"activation_7",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "training": false }
							}
						]
					},
					{
						"class_name": "GraphConv",
						"config": {
							"out_channels": 128,
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							}
						},
						"name": "graph_conv_4",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 64],
											"dtype": "float32",
											"keras_history": ["dropout_3", 0, 0]
										}
									}
								],
								"kwargs": {}
							}
						]
					},
					{
						"class_name": "BatchNormalization",
						"config": {
							"name": "batch_normalization_10",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"axis": -1,
							"momentum": 0.99,
							"epsilon": 0.001,
							"center": true,
							"scale": true,
							"beta_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"gamma_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"moving_mean_initializer": {
								"module": "keras.initializers",
								"class_name": "Zeros",
								"config": {},
								"registered_name": null
							},
							"moving_variance_initializer": {
								"module": "keras.initializers",
								"class_name": "Ones",
								"config": {},
								"registered_name": null
							},
							"beta_regularizer": null,
							"gamma_regularizer": null,
							"beta_constraint": null,
							"gamma_constraint": null,
							"synchronized": false
						},
						"name": "batch_normalization_10",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 128],
											"dtype": "float32",
											"keras_history": [
												"graph_conv_4",
												0,
												0
											]
										}
									}
								],
								"kwargs": { "mask": null }
							}
						]
					},
					{
						"class_name": "Activation",
						"config": {
							"name": "activation_8",
							"trainable": true,
							"dtype": {
								"module": "keras",
								"class_name": "DTypePolicy",
								"config": { "name": "float32" },
								"registered_name": null
							},
							"activation": "relu"
						},
						"name": "activation_8",
						"inbound_nodes": [
							{
								"args": [
									{
										"class_name": "__keras_tensor__",
										"config": {
											"shape": [null, 50, 33, 128],
											"dtype": "float32",
